; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 69249 2 3 3 4 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	spectrograph2 - mode
	infrared1 - mode
	image0 - mode
	Star1 - direction
	Star2 - direction
	Star0 - direction
	Star3 - direction
	Planet4 - direction
	Planet5 - direction
	Phenomenon6 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star3)
	(supports instrument2 image0)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet4)
	(supports instrument3 spectrograph2)
	(supports instrument3 image0)
	(calibration_target instrument3 Star3)
	(supports instrument4 infrared1)
	(supports instrument4 image0)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star3)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite1 Star1)
	(have_image Planet4 infrared1)
	(have_image Planet5 spectrograph2)
	(have_image Phenomenon6 spectrograph2)
))

)

; plan
1. (turn_to satellite1 star1 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star1)
   goals met: 1 of 4
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 4
3. (turn_to satellite0 star0 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star0)
   goals met: 1 of 4
4. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 4
5. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 1 of 4
6. (turn_to satellite1 planet4 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet4)
   goals met: 0 of 4
7. (turn_to satellite0 planet5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet5)
   goals met: 0 of 4
8. (turn_to satellite1 star1 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star1)
   goals met: 1 of 4
9. (take_image satellite0 planet5 instrument2 spectrograph2)
   added: (have_image planet5 spectrograph2)
   goals met: 2 of 4
10. (turn_to satellite1 planet4 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet4)
   goals met: 1 of 4
11. (turn_to satellite0 phenomenon6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon6)
   goals met: 1 of 4
12. (turn_to satellite1 star1 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star1)
   goals met: 2 of 4
13. (take_image satellite0 phenomenon6 instrument2 spectrograph2)
   added: (have_image phenomenon6 spectrograph2)
   goals met: 3 of 4
14. (turn_to satellite0 planet4 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet4)
   goals met: 3 of 4
15. (take_image satellite0 planet4 instrument2 infrared1)
   added: (have_image planet4 infrared1)
   goals met: 4 of 4
